In [1]:
#Creating Databases in MySQL
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="krish",
  password="#meKRISH30"
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7fc1247c3588>

In [2]:
#cursor for running the MySQL in Python Jupyter Notebook

cursor = mydb.cursor()

In [3]:
# Show The Database

cursor.execute('SHOW DATABASES')

for database in cursor:
    print(database)

('information_schema',)
('business',)
('dummy',)
('krish',)
('mysql',)
('performance_schema',)
('sys',)

In [4]:
# Create a new Database

#sql = 'CREATE DATABASE business'
#cursor.execute(sql)

In [5]:
# -selected database

cursor.execute('use business')

# CREATE_TABLE 

### SQL Constraints
* SQL constraints are used to specify rules for the data in a table.
* Constraints are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the table. If there is any violation between the constraint and the data action, the action is aborted.
* Constraints can be column level or table level. Column level constraints apply to a column, and table level constraints apply to the whole table.

The following constraints are commonly used in SQL:


### CREATE TABLE
* CREATE TABLE Persons (
*     PersonID int,
*     LastName varchar(255),
*     FirstName varchar(255),
*     Address varchar(255),
*     City varchar(255) );

### NOT NULL - 
* Ensures that a column cannot have a NULL value
##### SYNTEX
* CREATE TABLE Persons (
*     ID int NOT NULL,
*     LastName varchar(255) NOT NULL,
*     FirstName varchar(255) NOT NULL,
*     Age int );

### UNIQUE - 
* Ensures that all values in a column are different
##### SYNTEX
* CREATE TABLE Persons (
*     ID int NOT NULL UNIQUE,
*     LastName varchar(255) NOT NULL,
*     FirstName varchar(255),
*     Age int );

### PRIMARI KEY - (Remember- You need to give referance table where the column present)
* A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table
##### SYNTEX
* CREATE TABLE Persons (
*     ID int NOT NULL,
*     LastName varchar(255) NOT NULL,
*     FirstName varchar(255),
*     Age int,
*    PRIMARY KEY (ID) );

### FOREIGN KEY - 
* Uniquely identifies a row/record in another table
##### SYNTEX
* CREATE TABLE Orders (
*     OrderID int NOT NULL,
*     OrderNumber int NOT NULL,
*     PersonID int,
*     PRIMARY KEY (OrderID),
*     FOREIGN KEY (PersonID) REFERENCES Persons(PersonID) );

### CHECK - 
* Ensures that all values in a column satisfies a specific condition
##### SYNTEX
* CREATE TABLE Persons (
*     ID int NOT NULL,
*     LastName varchar(255) NOT NULL,
*     FirstName varchar(255),
*     Age int,
*     CHECK (Age>=18) );

### DEFAULT - 
* Sets a default value for a column when no value is specified
##### SYNTEX
* CREATE TABLE Persons (
*     ID int NOT NULL,
*     LastName varchar(255) NOT NULL,
*     FirstName varchar(255),
*     Age int,
*     City varchar(255) DEFAULT 'Sandnes' );

### INDEX - 
* Used to create and retrieve data from the database very quickly
##### SYNTEX
* CREATE INDEX index_name
* ON table_name (column1, column2, ...);

### AUTO INCREMENT -
* Auto-increment allows a unique number to be generated automatically when a new record is inserted into a table. MySQL uses the AUTO_INCREMENT keyword to perform an auto-increment feature.
##### SYNTEX
* CREATE TABLE Persons (
*     Personid int NOT NULL AUTO_INCREMENT,
*     LastName varchar(255) NOT NULL,
*     FirstName varchar(255),
*     Age int,
*     PRIMARY KEY (Personid) );

In [6]:
# Create a new table 

#sql= 'create table customers (CustomerID int NOT NULL UNIQUE AUTO_INCREMENT, CustomerName varchar(25), ContactName varchar(25), Address varchar(25), City varchar(25), PostalCode int, Country varchar(25), PRIMARY KEY(CustomerID) )'
#cursor.execute(sql)

In [7]:
#Insert Multiple values in Tables
"""
#sql = 'INSERT INTO customers(CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country) values(%s,%s,%s,%s,%s,%s,%s)'
val = [
    ('2','Asish Mondal', 'asis','xzafor', 'kolkata','854789', 'africa'),
    ('4','Narayan Bhowmick', 'Naran','bohich', 'tamluk','721649', 'Sriram'),
    ('5','Lopa Mudra', 'lopa','jumsedpur', 'jumsed','837889', 'Jharkhand'),
    ('6','Mallika Ghosh', 'mallu','durgapur', 'sodiya','495856', 'Westbengal'),
    ('7','Arushi Sinha', 'Rushi','Daryo', 'Ranchi','905436', 'Bihar'),
    ('8','Asifa Nasir', 'Asifa','narofade', 'Howrah','578439', 'Utterpradesh'),
    ('9','Moumita Giri', 'moumi','kuch v', 'Durgachak','567832', 'Haldia'),
    ('10','Mrityunjoy Sarkar', 'asis','badlapurr', 'Majapharpur','857819', 'africa'),
    ('11','Arnab Banerjee', 'Bantu','Kanpur', 'Durgapur','908742', 'Sriram'),
    ('12','Pallabi Barori', 'Tuli','Anand pur', 'Kallam','700076', 'West bengal'),
    ('13','Pranoy Samanta', 'Pranoy','Jaliwala', 'Nagpur','567432', 'Westbengal'),
    ('14','Prabhat gupta', 'prabhat','Potaspur', 'Kestopur','543289', 'africa'),
    ('15','Priyanjana Ghose', 'Priya','Panghor', 'Behala','789432', 'Westbengal'),
    ('16','Sweta Adhikari', 'Sweeti','Janina', 'Hatiberiya','478903', 'Utterpradesh'),
    ('17','Srinjoy Roy', 'Sinu','Kharagpur', 'medinipur','721751', 'Bihar'),
    ('18','Sourav Devsarma', 'Mota','Hatitola', 'kolkata','700032', 'Haldia'),
    ('19','Swastika Saha', 'Nati','Beleghata', 'kolkata','700046', 'Mumbai'),
    ('20','Zahab Khan', 'Zee','Hatighata', 'Khidirpur','700321', 'Mumbai')
    
]
cursor.executemany(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.") """

'\n#sql = \'INSERT INTO customers(CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country) values(%s,%s,%s,%s,%s,%s,%s)\'\nval = [\n    (\'2\',\'Asish Mondal\', \'asis\',\'xzafor\', \'kolkata\',\'854789\', \'africa\'),\n    (\'4\',\'Narayan Bhowmick\', \'Naran\',\'bohich\', \'tamluk\',\'721649\', \'Sriram\'),\n    (\'5\',\'Lopa Mudra\', \'lopa\',\'jumsedpur\', \'jumsed\',\'837889\', \'Jharkhand\'),\n    (\'6\',\'Mallika Ghosh\', \'mallu\',\'durgapur\', \'sodiya\',\'495856\', \'Westbengal\'),\n    (\'7\',\'Arushi Sinha\', \'Rushi\',\'Daryo\', \'Ranchi\',\'905436\', \'Bihar\'),\n    (\'8\',\'Asifa Nasir\', \'Asifa\',\'narofade\', \'Howrah\',\'578439\', \'Utterpradesh\'),\n    (\'9\',\'Moumita Giri\', \'moumi\',\'kuch v\', \'Durgachak\',\'567832\', \'Haldia\'),\n    (\'10\',\'Mrityunjoy Sarkar\', \'asis\',\'badlapurr\', \'Majapharpur\',\'857819\', \'africa\'),\n    (\'11\',\'Arnab Banerjee\', \'Bantu\',\'Kanpur\', \'Durgapur\',\'908742\', \'Sriram\'),\n    (\'12\',\'Pallabi Barori\', \'Tuli\',\'Anand pur\', \'Kallam\',\'700076\', \'West bengal\'),\n    (\'13\',\'Pranoy Samanta\', \'Pranoy\',\'Jaliwala\', \'Nagpur\',\'567432\', \'Westbengal\'),\n    (\'14\',\'Prabhat gupta\', \'prabhat\',\'Potaspur\', \'Kestopur\',\'543289\', \'africa\'),\n    (\'15\',\'Priyanjana Ghose\', \'Priya\',\'Panghor\', \'Behala\',\'789432\', \'Westbengal\'),\n    (\'16\',\'Sweta Adhikari\', \'Sweeti\',\'Janina\', \'Hatiberiya\',\'478903\', \'Utterpradesh\'),\n    (\'17\',\'Srinjoy Roy\', \'Sinu\',\'Kharagpur\', \'medinipur\',\'721751\', \'Bihar\'),\n    (\'18\',\'Sourav Devsarma\', \'Mota\',\'Hatitola\', \'kolkata\',\'700032\', \'Haldia\'),\n    (\'19\',\'Swastika Saha\', \'Nati\',\'Beleghata\', \'kolkata\',\'700046\', \'Mumbai\'),\n    (\'20\',\'Zahab Khan\', \'Zee\',\'Hatighata\', \'Khidirpur\',\'700321\', \'Mumbai\')\n    \n]\ncursor.executemany(sql,val)\nmydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.\n\nprint(cursor.rowcount, "record inserted.") '

In [8]:
# Create a new table 

#sql= 'create table orders (OrderID int NOT NULL UNIQUE AUTO_INCREMENT, CustomerID int, EmployeeID int, OrderDate varchar(25), ShipperID int, PRIMARY KEY(OrderID), FOREIGN KEY(CustomerID) REFERENCES customers(CustomerID))'
#cursor.execute(sql)

In [9]:
#Insert Multiple values in Tables
"""
sql = 'INSERT INTO orders(OrderID, CustomerID, EmployeeID, OrderDate, ShipperID) values(%s,%s,%s,%s,%s)'
val = [
    ('10308','02', '6','2020-12-12', '4'),
    ('10309','10', '7','2020-10-15', '3'),
    ('10310','20', '4','2019-12-22', '3'),
    ('10311','16', '6','2020-08-02', '1'),
    ('10312','12', '9','2020-11-17', '3'),
    ('10313','05', '3','2018-04-15', '4'),
    ('10314','12', '2','2020-12-02', '4'),
    ('10315','18', '1','2020-06-30', '2'),
    ('10316','06', '7','2019-03-14', '3'),
    ('10317','08', '5','2020-09-17', '1'),
    ('10318','09', '8','2020-10-19', '3'),
    ('10319','03', '3','2019-01-10', '4'),
    ('10320','02', '2','2020-11-22', '2'),
    ('10321','07', '8','2020-07-08', '4'),
    ('10322','10', '9','2020-05-13', '3'),
    ('10323','09', '4','2019-12-17', '3'),
    ('10324','07', '9','2020-10-10', '4'),
    ('10325','01', '2','2020-12-16', '1'),
    ('10326','04', '9','2018-05-22', '4'),
    ('10327','07', '6','2020-04-30', '3'),
    ('10328','05', '5','2020-10-27', '4')
    
]
cursor.executemany(sql,val)
mydb.commit()     #mydb.commit()--> It is required to make the changes, otherwise no changes are made to the table.

print(cursor.rowcount, "record inserted.")"""

21 record inserted.

# ALTER TABLE

In [10]:
# Create a new Database

#sql = 'CREATE DATABASE krish'
#cursor.execute(sql)

#ALTER TABLE table_name MODIFY COLUMN column_name datatype;

# Dates
MySQL comes with the following data types for storing a date or a date/time value in the database:

* DATE - format YYYY-MM-DD
* DATETIME - format: YYYY-MM-DD HH:MI:SS
* TIMESTAMP - format: YYYY-MM-DD HH:MI:SS
* YEAR - format YYYY or YY
#### SYNTEX
* SELECT * FROM Orders 
* WHERE OrderDate='2008-11-11'

In [15]:
# Dates

sql = "SELECT * FROM orders WHERE OrderDate='2020-12-16'"
cursor.execute(sql)

myresult = cursor.fetchall()

for x in myresult:
  print(x)

(10325, 1, 2, '2020-12-16', 1)

In [ ]:
# Create a new Database

#sql = 'CREATE DATABASE meKRISH'
#cursor.execute(sql)

In [ ]:
# DROP DATABASE 

#sql = 'DROP DATABASE meKRISH'
#cursor.execute(sql)

In [ ]:
# DROP TABLE 

#sql = 'DROP TABLE table_name'
#cursor.execute(sql)